// ConsoleApplication1.cpp: определяет точку входа для консольного приложения.
//

#include "stdafx.h"
#include <iostream>
/*ЛАБОРАТОРНАЯ РАБОТА
МАССИВЫ*/

int main()
{
    /*МАССИВ - блок из нескольких однотипных данных
	задавать массивом удобно:
	1) вектора и матрицы
	2) множество точек 2D И 3D
	*/
	// тип_данных имя_массива[размер] ={значение}
	
	// тип_данных имя_массива[размер1][размер2] ={значение}
	// int a [3][3]=
	// {{10, 5, 7}
	// {6, 4, 98}
	// {34, 65, 45}}
	int a[3][3]=
	{{1, 2, 3},
	{4, 5, 6},
	{7, 8, 9} };
	
	int b[3][3] =
	{ { 3, 4, 5 },
	{ 6, 7, 8 },
	{ 1, 2, 4 } };
	
	int c[3][3] = { {0} };
	c[0][0] = a[0][0] * b[0][0] + b[1][0] * a[0][1] + a[0][2] * b[2][0];
	c[0][1] = a[0][0] * b[0][1] + b[1][1] * a[0][1] + a[0][2] * b[2][1];
	c[0][2] = a[0][0] * b[0][2] + b[1][2] * a[0][1] + a[0][2] * b[2][2];
	std::cout << c[0][0]<<" "<< c[0][1]<<" " << c[0][2] << "\n" << std::endl;
	
	c[1][0] = a[1][0] * b[0][0] + b[1][0] * a[1][1] + a[1][2] * b[2][0];
	c[1][1] = a[1][0] * b[0][1] + b[1][1] * a[1][1] + a[1][2] * b[2][1];
	c[1][2] = a[1][0] * b[0][2] + b[1][2] * a[1][1] + a[1][2] * b[2][2];
	std::cout << c[1][0] << " " << c[1][1] << " " << c[1][2] << "\n" << std::endl;

	c[2][0] = a[2][0] * b[0][0] + b[1][0] * a[2][1] + a[2][2] * b[2][0];
	c[2][1] = a[2][0] * b[0][1] + b[1][1] * a[2][1] + a[2][2] * b[2][1];
	c[2][2] = a[2][0] * b[0][2] + b[1][2] * a[2][1] + a[2][2] * b[2][2];
	std::cout << c[2][0] << " " << c[2][1] << " " << c[2][2] << "\n" << std::endl;
	
	return 0;
}

